Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Celery beat is now storing the tasks schedule in the database, ``CELERY_BEAT_SCHEDULER`` and :setting:`django:INSTALLED_APPS` need to be changed for that.
sv: Celery Beat lagrar nu uppgiftschemat i databasen, ``CELERY_BEAT_SCHEDULER`` och :setting:`django:INSTALLED_APPS` mÃ¥ste Ã¤ndras fÃ¶r detta.

source: The deprecated VCS setting for credentials is no longer supported, see :ref:`up-4-14`.
sv: Den fÃ¶rÃ¥ldrade VCS-instÃ¤llningen fÃ¶r autentiseringsuppgifter stÃ¶ds inte lÃ¤ngre, se :ref:`up-4-14`.

source: Upgrade of `django-crispy-forms` requires changes in :setting:`django:INSTALLED_APPS`.
sv: Uppgradering av `django-crispy-forms` krÃ¤ver Ã¤ndringar i :setting:`django:INSTALLED_APPS`.

source: Integration of `django-cors-headers` requires changes in :setting:`django:INSTALLED_APPS` and :setting:`django:MIDDLEWARE`.
sv: Integration av `django-cors-headers` krÃ¤ver Ã¤ndringar i :setting:`django:INSTALLED_APPS` och :setting:`django:MIDDLEWARE`.

source: Introduction of :setting:`CACHE_DIR` changed default value of :setting:`django:STATIC_ROOT`. You might need to adjust :ref:`static-files` accordingly.
sv: InfÃ¶randet av :setting:`CACHE_DIR` Ã¤ndrade standardvÃ¤rdet fÃ¶r :setting:`django:STATIC_ROOT`. Du kan behÃ¶va justera :ref:`static-files` i enlighet med detta.

source: *Released on January 25th 2023.*
sv: *SlÃ¤pptes den 25 januari 2023.*

source: Enabled gotext JSON and i18next v4 formats in the default configuration.
sv: Aktiverade gotext JSON- och i18next v4-format i standardkonfigurationen.

source: Fixed crash on uploading corrupted files.
sv: Fixat krasch vid uppladdning av korrupta filer.

source: Show stale directories in Git repository status.
sv: Visa inaktiva kataloger i Git-repositoriets status.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/91?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/91?closed=1>`__.

source: *Released on January 19th 2023.*
sv: *SlÃ¤pptes den 19 januari 2023.*

source: Fixed suggestions from automatic translation.
sv: Korrigeringar av fÃ¶rslag frÃ¥n automatisk Ã¶versÃ¤ttning.

source: Fixed add-on page crash in some corner cases.
sv: Fixat tillÃ¤ggssidekrasch i vissa specialfall.

source: Fixed untranslating template for new translations in some cases.
sv: Fixade mallar som inte Ã¶versattes fÃ¶r nya Ã¶versÃ¤ttningar i vissa fall.

source: Documented licensing using `REUSE 3.0 <https://reuse.software/>`_.
sv: Dokumenterad licensiering med `REUSE 3.0 <https://reuse.software/>`_.

source: Fixed users pagination on team management.
sv: Fixat sidnumrering fÃ¶r anvÃ¤ndare i teamhanteringen.

source: Improved performance of project creation and saving.
sv: FÃ¶rbÃ¤ttrad prestanda vid skapande och sparande av projekt.

source: Added support for gotext JSON files.
sv: StÃ¶d fÃ¶r gotext JSON-filer har lagts till.

source: Added support for i18next v4 files.
sv: StÃ¶d fÃ¶r i18next v4-filer har lagts till.

source: Pagination in the API is now customizable.
sv: Sidnumrering i API:et Ã¤r nu anpassningsbar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/90?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/90?closed=1>`__.

source: *Released on December 16th 2022.*
sv: *SlÃ¤pptes den 16 december 2022.*

source: Added support for browsing all changes for an individual string.
sv: Lagt till stÃ¶d fÃ¶r att blÃ¤ddra igenom alla Ã¤ndringar fÃ¶r en enskild strÃ¤ng.

source: Fixed plurals handling in automatic translation from other components.
sv: Fixat hanteringen av pluralformer vid automatisk Ã¶versÃ¤ttning frÃ¥n andra komponenter.

source: Added keyboard shortcut Alt+Enter to submit string as a suggestion.
sv: Lagt till kortkommandot Alt+Enter fÃ¶r att skicka in strÃ¤ngen som ett fÃ¶rslag.

source: Added support for placeables in the Fluent format.
sv: StÃ¶d fÃ¶r placerbara objekt i Fluent-format har lagts till.

source: Improved performance of translation memory.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r Ã¶versÃ¤ttningsminnet.

source: Autogenerate repoweb browsing links for well known code hosting services.
sv: Autogenerera repoweb-surflÃ¤nkar fÃ¶r vÃ¤lkÃ¤nda kodhostingtjÃ¤nster.

source: Improved performance of several views.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r flera vyer.

source: Improved listing of strings with plurals.
sv: FÃ¶rbÃ¤ttrad listning av strÃ¤ngar med pluralformer.

source: Added support for adding custom markup to HTML head.
sv: Lagt till stÃ¶d fÃ¶r att lÃ¤gga till anpassade markeringar i HTML-huvudet.

source: Fixed generation of MO files in the add-on to include only translated files.
sv: Fast generering av MO-filer i tillÃ¤gget sÃ¥ att endast Ã¶versatta filer inkluderas.

source: Fixed rendering of regular expression flags.
sv: Fast rendering av flaggor fÃ¶r reguljÃ¤ra uttryck.

source: Improved placeholders check behavior with plurals.
sv: FÃ¶rbÃ¤ttrad kontroll av platshÃ¥llare med pluralformer.

source: Added support for translation files naming suitable for Google Play.
sv: Lagt till stÃ¶d fÃ¶r namngivning av Ã¶versÃ¤ttningsfiler som passar fÃ¶r Google Play.

source: Added support for labels in API.
sv: StÃ¶d fÃ¶r etiketter i API har lagts till.

source: Added support for choosing different e-mail for commits than for notifications.
sv: Lagt till stÃ¶d fÃ¶r att vÃ¤lja olika e-postadresser fÃ¶r commit och fÃ¶r aviseringar.

source: The Docker image no longer enables debug mode by default.
sv: Docker-bilden aktiverar inte lÃ¤ngre felsÃ¶kningslÃ¤get som standard.

source: Order glossary terms based on the glossary component priority.
sv: Ordna termerna i ordlistan utifrÃ¥n ordlistans komponentprioritet.

source: Added team administrators who can add or remove members of the team.
sv: Lagt till teamadministratÃ¶rer som kan lÃ¤gga till eller ta bort medlemmar i teamet.

source: Added a popup confirmation before deleting users.
sv: Lagt till en popup-bekrÃ¤ftelse innan anvÃ¤ndare raderas.

source: Added add-on to customize XML output.
sv: TillÃ¤gg fÃ¶r att anpassa XML-utdata.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/88?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/88?closed=1>`__.

source: Weblate now requires ``btree_gin`` extension in PostgreSQL. The migration process will install it if it has sufficient privileges. See :ref:`dbsetup-postgres` for manual setup.
sv: Weblate krÃ¤ver nu tillÃ¤gget ``btree_gin`` i PostgreSQL. Migrationsprocessen installerar det om den har tillrÃ¤ckliga behÃ¶righeter. Se :ref:`dbsetup-postgres` fÃ¶r manuell installation.

source: The Docker image no longer enables debug mode by default. In case you want it, enable it in the environment using :envvar:`WEBLATE_DEBUG`.
sv: Docker-bilden aktiverar inte lÃ¤ngre felsÃ¶kningslÃ¤get som standard. Om du vill anvÃ¤nda det kan du aktivera det i miljÃ¶n med hjÃ¤lp av :envvar:`WEBLATE_DEBUG`.

source: The database migration make take hours on larger instances due to recreating some of the indexes.
sv: Databasmigreringen kan ta flera timmar pÃ¥ stÃ¶rre instanser pÃ¥ grund av att vissa index mÃ¥ste skapas om.

source: **Changed in 4.15.1:** The default value for ``DEFAULT_PAGINATION_CLASS`` in rest framework settings was changed.
sv: **Ãndrat i 4.15.1:** StandardvÃ¤rdet fÃ¶r ``DEFAULT_PAGINATION_CLASS`` i rest framework-instÃ¤llningarna har Ã¤ndrats.

source: *Released on November 5th 2022.*
sv: *SlÃ¤pptes den 5 november 2022.*

source: Added support for removing entries from translation memory.
sv: Lagt till stÃ¶d fÃ¶r att ta bort poster frÃ¥n Ã¶versÃ¤ttningsminnet.

source: Improved analysis on the duplicate language alert.
sv: FÃ¶rbÃ¤ttrad analys av varningen om dubbla sprÃ¥k.

source: Improved accuracy of the consecutive duplicated-words check.
sv: FÃ¶rbÃ¤ttrad noggrannhet vid kontroll av upprepade ord i fÃ¶ljd.

source: Improved scaling of sending many notifications.
sv: FÃ¶rbÃ¤ttrad skalning vid sÃ¤ndning av mÃ¥nga aviseringar.

source: Improved string-state handling for subtitle translation.
sv: FÃ¶rbÃ¤ttrad hantering av strÃ¤ngstatus fÃ¶r Ã¶versÃ¤ttning av undertexter.

source: Deprecated insecure configuration of VCS service API keys via _TOKEN/_USERNAME configuration instead of _CREDENTIALS list.
sv: FÃ¶rÃ¥ldrad osÃ¤ker konfiguration av VCS-tjÃ¤nstens API-nycklar via _TOKEN/_USERNAME-konfiguration istÃ¤llet fÃ¶r _CREDENTIALS-listan.

source: Fixed processing of some uploaded CSV files.
sv: Fixat bearbetningen av vissa uppladdade CSV-filer.

source: Improved whitespace changes handling in diff display.
sv: FÃ¶rbÃ¤ttrad hantering av blankstegsÃ¤ndringar i diff-visningen.

source: Added link for managing automatic suggestions to the management pages.
sv: LÃ¤nk fÃ¶r hantering av automatiska fÃ¶rslag har lagts till pÃ¥ administrationssidorna.

source: Track comment removal/resolving in history.
sv: SpÃ¥ra borttagning/lÃ¶sning av kommentarer i historiken.

source: Fixed restoring project backups with linked components.
sv: Fixade Ã¥terstÃ¤llning av projektbackuper med lÃ¤nkade komponenter.

source: Fixed CAPTCHA entering on unsuccessful registration.
sv: Fixat CAPTCHA-inmatning vid misslyckad registrering.

source: Improved languages support in DeepL.
sv: FÃ¶rbÃ¤ttrat sprÃ¥kstÃ¶d i DeepL.

source: Improved webhooks compatibility with authenticated repositories.
sv: FÃ¶rbÃ¤ttrad kompatibilitet mellan webhooks och autentiserade arkiv.

source: Added support for Python 3.11.
sv: StÃ¶d fÃ¶r Python 3.11 har lagts till.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/87?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/87?closed=1>`__.

source: *Released on September 15th 2022.*
sv: *SlÃ¤pptes den 15 september 2022.*

source: Fixed generating project backups in some situations.
sv: Fixade generering av projektbackuper i vissa situationer.

source: Improved error reporting when uploading files.
sv: FÃ¶rbÃ¤ttrad felrapportering vid uppladdning av filer.

source: Fetch all user verified e-mails from GitHub during authentication.
sv: HÃ¤mta alla anvÃ¤ndarverifierade e-postadresser frÃ¥n GitHub under autentiseringen.

source: Avoid matching glossary terms on context or keys.
sv: Undvik att matcha ordlista termer pÃ¥ kontext eller nycklar.

source: Added notifications for string removals.
sv: Lagt till aviseringar fÃ¶r borttagning av strÃ¤ngar.

source: Improved management of untranslatable terms in glossary.
sv: FÃ¶rbÃ¤ttrad hantering av icke Ã¶versÃ¤ttningsbara termer i ordlistan.

source: List number of team members on team management page.
sv: Ange antalet teammedlemmar pÃ¥ sidan fÃ¶r teamhantering.

source: Add group management interface.
sv: LÃ¤gg till grÃ¤nssnitt fÃ¶r grupphantering.

source: Always show review stats when reviews are turned on.
sv: Visa alltid recensionsstatistik nÃ¤r recensioner Ã¤r aktiverade.

source: Added searching support in units API.
sv: Lagt till sÃ¶kstÃ¶d i enhets-API.

source: Fixed progress bar display for read-only strings in the review workflow.
sv: Fast visning av fÃ¶rloppsindikator fÃ¶r skrivskyddade strÃ¤ngar i granskningsarbetsflÃ¶det.

source: Improved punctuation checks for Burmese.
sv: FÃ¶rbÃ¤ttrad interpunktionskontroll fÃ¶r burmesiska.

source: Fixed garbage collecting of metrics data.
sv: Fast sopuppsamling av mÃ¤tdata.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/86?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/86?closed=1>`__.

source: *Released on August 22nd 2022.*
sv: *SlÃ¤pptes den 22 augusti 2022.*

source: Track add-on changes in a history.
sv: SpÃ¥ra tillÃ¤ggsÃ¤ndringar i en historik.

source: Fixed parsing translation from Windows RC, HTML and text files.
sv: Fast parsning av Ã¶versÃ¤ttning frÃ¥n Windows RC-, HTML- och textfiler.

source: Extended language code style configuration options.
sv: UtÃ¶kade konfigurationsalternativ fÃ¶r sprÃ¥kkodstil.

source: Added support for plurals updated in the recent CLDR releases.
sv: StÃ¶d fÃ¶r pluralformer som uppdaterats i de senaste CLDR-utgÃ¥vorna har lagts till.

source: Reduced memory usage while updating components with a lot of translations.
sv: Minskad minnesanvÃ¤ndning vid uppdatering av komponenter med mÃ¥nga Ã¶versÃ¤ttningar.

source: Added support for translation domain in SAP Translation Hub.
sv: StÃ¶d fÃ¶r Ã¶versÃ¤ttningsdomÃ¤n har lagts till i SAP Translation Hub.

source: Allow absolute links in source string locations.
sv: TillÃ¥t absoluta lÃ¤nkar i kÃ¤llstrÃ¤ngens platser.

source: Improved operation behind some reverse proxies.
sv: FÃ¶rbÃ¤ttrad funktion bakom vissa omvÃ¤nda proxyservrar.

source: Extended API to cover translation memory.
sv: UtÃ¶kat API fÃ¶r att tÃ¤cka Ã¶versÃ¤ttningsminne.

source: Improved document translation workflow.
sv: FÃ¶rbÃ¤ttrat arbetsflÃ¶de fÃ¶r dokumentÃ¶versÃ¤ttning.

source: Improved reliability of HTML and text files translation.
sv: FÃ¶rbÃ¤ttrad tillfÃ¶rlitlighet vid Ã¶versÃ¤ttning av HTML- och textfiler.

source: Added support for project level backups.
sv: StÃ¶d fÃ¶r sÃ¤kerhetskopiering pÃ¥ projektnivÃ¥ har lagts till.

source: Improved performance and memory usage of translation memory lookups.
sv: FÃ¶rbÃ¤ttrad prestanda och minnesanvÃ¤ndning vid sÃ¶kningar i Ã¶versÃ¤ttningsminnet.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/84?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/84?closed=1>`__.

source: The Java formatting checks now match GNU gettext flags. The flags set in Weblate will be automatically migrated, but third-party scripts will need to use ``java-printf-format`` instead of ``java-format`` and ``java-format`` instead of ``java-messageformat``.
sv: Java-formateringskontrollerna matchar nu GNU gettext-flaggor. Flaggorna som stÃ¤llts in i Weblate kommer att migreras automatiskt, men tredjepartsskript mÃ¥ste anvÃ¤nda ``java-printf-format`` istÃ¤llet fÃ¶r ``java-format`` och ``java-format`` istÃ¤llet fÃ¶r ``java-messageformat``.

source: The `jellyfish` dependency has been replaced by `rapidfuzz`.
sv: Beroendet `jellyfish` har ersatts av `rapidfuzz`.

source: **Changed in 4.14.2:** Deprecated insecure configuration of VCS service API keys via _TOKEN/_USERNAME configuration instead of _CREDENTIALS list. In Docker, please add matching _HOST directive. For example see :envvar:`WEBLATE_GITHUB_HOST` and :setting:`GITHUB_CREDENTIALS`.
sv: **Ãndrat i 4.14.2:** FÃ¶rÃ¥ldrad osÃ¤ker konfiguration av VCS-tjÃ¤nstens API-nycklar via _TOKEN/_USERNAME-konfiguration istÃ¤llet fÃ¶r _CREDENTIALS-listan. I Docker, lÃ¤gg till matchande _HOST-direktiv. Se till exempel :envvar:`WEBLATE_GITHUB_HOST` och :setting:`GITHUB_CREDENTIALS`.

source: *Released on July 1st 2022.*
sv: *SlÃ¤pps den 1 juli 2022.*

source: Fixed tracking suggestions in history.
sv: Fasta spÃ¥rningsfÃ¶rslag i historiken.

source: Fixed parsing reverse proxy info from Cloudflare.
sv: Fixat parsning av omvÃ¤nd proxyinformation frÃ¥n Cloudflare.

source: Make parse errors lock translation of a component.
sv: GÃ¶r sÃ¥ att parsningsfel lÃ¥ser Ã¶versÃ¤ttningen av en komponent.

source: Fixed configuring intermediate file in the discovery add-on.
sv: Fixat konfigurerande mellanliggande fil i upptÃ¤cktstillÃ¤gget.

source: Fixed DeepL translations behavior with placeholders.
sv: Fixat DeepL-Ã¶versÃ¤ttningarnas beteende med platshÃ¥llare.

source: Fixed untranslating strings via API.
sv: Fixade strÃ¤ngar som inte Ã¶versattes via API.

source: Added support for removing a user from a group via API.
sv: Lagt till stÃ¶d fÃ¶r att ta bort en anvÃ¤ndare frÃ¥n en grupp via API.

source: Fixed audit log for user invitation e-mails.
sv: FaststÃ¤lld revisionslogg fÃ¶r e-postmeddelanden med inbjudningar till anvÃ¤ndare.

source: Fixed flag names for Java formatting strings.
sv: Fasta flaggnamn fÃ¶r Java-formateringsstrÃ¤ngar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/85?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/85?closed=1>`__.

source: *Released on June 15th 2022.*
sv: *SlÃ¤pps den 15 juni 2022.*

source: Changed behavior of updating language names.
sv: Ãndrat beteende vid uppdatering av sprÃ¥knamn.

source: Added pagination to projects listing.
sv: Lagt till paginering i projektlistan.

source: API for creating new units now returns info about newly created unit.
sv: API fÃ¶r att skapa nya enheter returnerar nu information om nyskapade enheter.

source: Component discovery now supports configuring an intermediate language.
sv: KomponentupptÃ¤ckt stÃ¶der nu konfigurering av ett mellanliggande sprÃ¥k.

source: Added fixed encoding variants to CSV formats.
sv: Lade till fasta kodningsvarianter till CSV-format.

source: Changed handling of context and location for some formats to better fit underlying implementation.
sv: Ãndrad hantering av sammanhang och plats fÃ¶r vissa format fÃ¶r att bÃ¤ttre passa den underliggande implementeringen.

source: Added support for the ResourceDictionary format.
sv: StÃ¶d fÃ¶r formatet ResourceDictionary har lagts till.

source: Improved progress-bar colors for color-blind people.
sv: FÃ¶rbÃ¤ttrade fÃ¤rger pÃ¥ fÃ¶rloppsindikatorn fÃ¶r personer med fÃ¤rgblindhet.

source: Fixed variants cleanup when removing strings.
sv: RÃ¤ttade uppstÃ¤dningen av varianter vid borttagning av strÃ¤ngar.

source: Compatibility with Django 4.1.
sv: Kompatibilitet med Django 4.1.

source: Added support for storing escaped XML elements in XLIFF.
sv: Lagt till stÃ¶d fÃ¶r lagring av undantagna XML-element i XLIFF.

source: Improved formatting of placeholder-check errors.
sv: FÃ¶rbÃ¤ttrad formatering av fel i platshÃ¥llarkontroller.

source: Redirect /.well-known/change-password to /accounts/password/.
sv: Omdirigera /.well-known/change-password till /accounts/password/.

source: Machine translation services are now configurable per project.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nster kan nu konfigureras per projekt.

source: Added separate permission for resolving comments and grant it to the :guilabel:`Review strings` role.
sv: Lagt till separat behÃ¶righet fÃ¶r att lÃ¶sa kommentarer och bevilja den till rollen :guilabel:`Granska strÃ¤ngar`.

source: Added support for storing alternative translations in the CSV file.
sv: Lagt till stÃ¶d fÃ¶r lagring av alternativa Ã¶versÃ¤ttningar i CSV-filen.

source: The placeholders check can now be case-insensitive as well.
sv: PlatshÃ¥llarkontrollen kan nu ocksÃ¥ vara skiftlÃ¤gesokÃ¤nslig.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/81?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/81?closed=1>`__.

source: The :ref:`languages` are now automatically updated on upgrade, use :setting:`UPDATE_LANGUAGES` to disable that.
sv: :ref:`languages` uppdateras nu automatiskt vid uppgradering. AnvÃ¤nd instÃ¤llningen :setting:`UPDATE_LANGUAGES` fÃ¶r att inaktivera detta.

source: Handling of context and location has been changed for :ref:`winrc`, :ref:`html`, :ref:`idml`, and :ref:`txt` file formats. In most cases the context is now shown as location.
sv: Hanteringen av kontext och plats har Ã¤ndrats fÃ¶r filformaten :ref:`winrc`, :ref:`html`, :ref:`idml` och :ref:`txt`. I de flesta fall visas nu kontexten som plats.

source: The machine translation services are now configured using the user interface, settings from the configuration file will be imported during the database migration.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nsterna konfigureras nu via anvÃ¤ndargrÃ¤nssnittet, och instÃ¤llningarna frÃ¥n konfigurationsfilen importeras under databasmigreringen.

source: *Released on May 11th 2022.*
sv: *SlÃ¤pptes den 11 maj 2022.*

source: Fixed rebuilding project translation-memory for some components.
sv: Fixat ombyggnadsprojektets Ã¶versÃ¤ttningsminne fÃ¶r vissa komponenter.

source: Fixed sorting components by untranslated strings.
sv: Fixade sorteringskomponenter efter icke Ã¶versatta strÃ¤ngar.

source: Fixed possible loss of translations while adding a new language.
sv: Fixat mÃ¶jligt fÃ¶rlust av Ã¶versÃ¤ttningar vid tillÃ¤gg av ett nytt sprÃ¥k.

source: Ensure Weblate SSH key is generated during migrations.
sv: Se till att Weblate SSH-nyckel genereras under migreringar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/83?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/83?closed=1>`__.

source: *Released on April 29th 2022.*
sv: *SlÃ¤pptes den 29 april 2022.*

source: Fixed pull request message title.
sv: RÃ¤ttat titeln pÃ¥ pull-fÃ¶rfrÃ¥gan.

source: Improved syntax error handling in Fluent format.
sv: FÃ¶rbÃ¤ttrad hantering av syntaxfel i Fluent-format.

source: Fixed avatar display in notification e-mails.
sv: Fast avatarvisning i e-postmeddelanden med aviseringar.

source: Add support for web monetization.
sv: LÃ¤gg till stÃ¶d fÃ¶r intÃ¤ktsgenerering pÃ¥ webben.

source: Fixed removal of stale source strings when removing translations.
sv: Fast borttagning av gamla kÃ¤llstrÃ¤ngar vid borttagning av Ã¶versÃ¤ttningar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/82?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/82?closed=1>`__.

source: *Released on April 20th 2022.*
sv: *SlÃ¤pptes den 20 april 2022.*

source: Added support for Amharic in :ref:`check-end-stop`.
sv: Lagt till stÃ¶d fÃ¶r amhariska i :ref:`check-end-stop`.

source: Added support for Burmese in :ref:`check-end-question`.
sv: Lagt till stÃ¶d fÃ¶r burmesiska i :ref:`check-end-question`.

source: Extended options of the :ref:`addon-weblate.generate.pseudolocale` add-on.
sv: UtÃ¶kade alternativ fÃ¶r tillÃ¤gget :ref:`addon-weblate.generate.pseudolocale`.

source: Added ``ignore-all-checks`` flag to ignore all quality checks on a string.
sv: Lade till flaggan ``ignore-all-checks`` fÃ¶r att ignorera alla kvalitetskontroller pÃ¥ en strÃ¤ng.

source: Avoid :ref:`addon-weblate.generate.pseudolocale` add-on to trigger failing checks.
sv: Undvik tillÃ¤gget :ref:`addon-weblate.generate.pseudolocale` fÃ¶r att undvika felaktiga kontroller.

source: Added support for :ref:`vcs-gitea`.
sv: Lagt till stÃ¶d fÃ¶r :ref:`vcs-gitea`.

source: Added Linux-style language code to :ref:`component-language_code_style`.
sv: Lade till sprÃ¥kkod i Linux-stil till :ref:`component-language_code_style`.

source: Added support for rebuilding project translation memory.
sv: Lagt till stÃ¶d fÃ¶r att Ã¥teruppbygga projektets Ã¶versÃ¤ttningsminne.

source: Improved API for creating components from a file.
sv: FÃ¶rbÃ¤ttrad API fÃ¶r att skapa komponenter frÃ¥n en fil.

source: Add copy and clone buttons to other translations.
sv: LÃ¤gg till kopiera- och klona-knappar till andra Ã¶versÃ¤ttningar.

source: Make merge request message configurable at the component level.
sv: GÃ¶r det mÃ¶jligt att konfigurera meddelanden om sammanfogningsfÃ¶rfrÃ¥gningar pÃ¥ komponentnivÃ¥.

source: Improved behavior of maximal-length restriction with XML tags.
sv: FÃ¶rbÃ¤ttrat beteende fÃ¶r maximal lÃ¤ngdbegrÃ¤nsning med XML-taggar.

source: Fixed loading Fluent files with additional comments.
sv: Fast laddning av Fluent-filer med ytterligare kommentarer.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/77?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/77?closed=1>`__.

source: There are no special steps required.
sv: Inga sÃ¤rskilda Ã¥tgÃ¤rder krÃ¤vs.

source: *Released on March 4th 2022.*
sv: *SlÃ¤pptes den 4 mars 2022.*

source: Fixed corrupted MO files in the binary release.
sv: Fixade korrupta MO-filer i den binÃ¤ra versionen.
